#+FILETAGS: ACADEMIC

** CANCELLED Investigate Tsinghua Sanya conference
   - State "CANCELLED"  from "NEXT"       [2012-11-09 Fri 10:30] \\
     I won't be able to leave Kate and the kids
[[http://msc.tsinghua.edu.cn/forum2013/][TSIMF]]
  CLOCK: [2012-10-25 Thu 11:30]--[2012-10-25 Thu 11:31] =>  0:01
[2012-10-25 Thu 11:30]

** SOMEDAY Research getting grants
I want mostly travel money 
Can I hire a car so we can all go on a road trip?
I need books
I want to do some sage or org-mode devel
I want to do teaching with sage-tex and/or org-mode with babel; i.e. interactive lectures so I can change the parameters of things like plots in real time
  CLOCK: [2012-10-14 Sun 20:40]--[2012-10-14 Sun 20:41] =>  0:01
   :PROPERTIES:
   :ID:       d0bbb971-d0e5-4463-b1be-1cbcfbf54db3
   :END:
[2012-10-14 Sun 20:40]

**** DONE Investigate data management plan workshop
   - State "DONE"       from "TODO"       [2012-11-09 Fri 11:20]
[[http://libraries.ucsd.edu/services/data-curation/data-management-plan/workshop.html][data management plan workshop]]
  CLOCK: [2012-10-19 Fri 14:11]--[2012-10-19 Fri 14:12] =>  0:01
   :PROPERTIES:
   :ID:       26658a79-21fd-4a3b-880c-ee7e7644274d
   :END:
[2012-10-19 Fri 14:11]

*** DONE Review [[file:refs.org::#MR2948294][Weighted isoperimetric inequalities in cones and applications]]
   SCHEDULED: <2012-12-06 Thu> DEADLINE: <2013-01-14 Mon>
   - State "DONE"       from "NEXT"       [2012-12-17 Mon 19:42]

   :PROPERTIES:
   :ID:       3c09baae-b235-405f-837f-24a9b1801418
   :END:
   :LOGBOOK:
   CLOCK: [2012-12-17 Mon 19:16]--[2012-12-17 Mon 19:41] =>  0:25
   CLOCK: [2012-12-11 Tue 19:33]--[2012-12-11 Tue 19:45] =>  0:12
   CLOCK: [2012-12-11 Tue 18:15]--[2012-12-11 Tue 19:33] =>  1:18
   CLOCK: [2012-12-11 Tue 16:49]--[2012-12-11 Tue 17:34] =>  0:45
   CLOCK: [2012-12-06 Thu 16:20]--[2012-12-06 Thu 16:40] =>  0:20
   :END:
[[file:~/working/academic/journals/review/MR2948294]]

*** DONE Review Generic MCF I
   SCHEDULED: <2013-02-04 Mon> DEADLINE: <2013-02-28 Thu>
   - State "DONE"       from "NEXT"       [2013-03-12 Tue 21:09]
   :LOGBOOK:
   CLOCK: [2013-03-12 Tue 20:35]--[2013-03-12 Tue 21:09] =>  0:34
   CLOCK: [2013-03-12 Tue 20:15]--[2013-03-12 Tue 20:27] =>  0:12
   CLOCK: [2013-03-12 Tue 16:44]--[2013-03-12 Tue 17:35] =>  0:51
   CLOCK: [2013-03-12 Tue 08:46]--[2013-03-12 Tue 09:31] =>  0:45
   CLOCK: [2013-02-19 Tue 21:17]--[2013-02-19 Tue 21:49] =>  0:32
   CLOCK: [2013-02-14 Thu 13:15]--[2013-02-14 Thu 14:25] =>  1:10
   CLOCK: [2013-02-11 Mon 09:15]--[2013-02-11 Mon 10:15] =>  1:00
   CLOCK: [2013-02-08 Fri 08:57]--[2013-02-08 Fri 09:26] =>  0:29
   CLOCK: [2013-02-06 Wed 21:00]--[2013-02-06 Wed 21:48] =>  0:48
   :END:
   :PROPERTIES:
   :ID:       402957bd-262b-4fba-8630-1192eef2bc86
   :END:
[[file:~/research_resources/papers/MR2993752.pdf]]
[MR2993752 Colding, Tobias H.\ and Minicozzi, William P., II,  Generic mean curvature flow I: generic singularities, Ann. of Math. (2) 175 (2012), no. 2, 755--833]
[[file:refs.org::#MR2993752][Generic mean curvature flow {I}: generic singularities]]

*** DONE Edit CEJM-D-12-00160R1
    DEADLINE: <2013-04-03 Wed>
    - State "DONE"       from ""           [2013-04-09 Tue 11:34]
    :LOGBOOK:
    CLOCK: [2013-04-09 Tue 10:40]--[2013-04-09 Tue 11:34] =>  0:54
    CLOCK: [2013-03-28 Thu 13:52]--[2013-03-28 Thu 14:25] =>  0:33
    :END:
    :PROPERTIES:
    :ID:       58529b2b-87b8-4680-9a66-f065da5cac50
    :END:
[[file:~/working/academic/journals/editing/cejm/CEJM-D-12-00160R1]]

*** DONE Referee space curves CSF dist comp.
   DEADLINE: <2013-04-17 Wed> SCHEDULED: <2013-02-04 Mon>
   - State "DONE"       from "NEXT"       [2013-02-13 Wed 13:48]
   :LOGBOOK:
   CLOCK: [2013-02-13 Wed 13:39]--[2013-02-13 Wed 13:48] =>  0:09
   CLOCK: [2013-02-13 Wed 13:02]--[2013-02-13 Wed 13:31] =>  0:29
   CLOCK: [2013-02-13 Wed 12:45]--[2013-02-13 Wed 13:00] =>  0:15
   CLOCK: [2013-02-13 Wed 10:35]--[2013-02-13 Wed 10:55] =>  0:20
   CLOCK: [2013-02-13 Wed 10:05]--[2013-02-13 Wed 13:00] =>  2:55
   CLOCK: [2013-02-11 Mon 10:35]--[2013-02-11 Mon 10:55] =>  0:20
   CLOCK: [2013-01-30 Wed 10:19]--[2013-01-30 Wed 10:55] =>  0:36
   CLOCK: [2013-01-25 Fri 12:52]--[2013-01-25 Fri 14:06] =>  1:14
   CLOCK: [2013-01-24 Thu 20:47]--[2013-01-24 Thu 21:28] =>  0:41
   CLOCK: [2013-01-24 Thu 20:05]--[2013-01-24 Thu 20:27] =>  0:22
   :END:
   :PROPERTIES:
   :ID:       5e7ae258-0dc1-492c-a8ce-7b311de879b1
   :END:
[[file:refs.org::#GEOM-D-13-00010][Distance comparison principle and Grayson type theorem in the three dimensional curve shortening flow]]

**** TODO alpha CSF distance comparison				  :CSF_ALPHA:
   :LOGBOOK:
   CLOCK: [2013-02-20 Wed 13:54]--[2013-02-20 Wed 13:55] =>  0:01
   CLOCK: [2013-02-14 Thu 12:21]--[2013-02-14 Thu 12:29] =>  0:08
   CLOCK: [2013-02-14 Thu 12:15]--[2013-02-14 Thu 12:21] =>  0:06
   CLOCK: [2013-02-14 Thu 11:53]--[2013-02-14 Thu 12:05] =>  0:12
   CLOCK: [2013-02-14 Thu 09:59]--[2013-02-14 Thu 10:44] =>  0:45
   CLOCK: [2012-12-18 Tue 15:11]--[2012-12-18 Tue 15:12] =>  0:01
   :END:
   :PROPERTIES:
   :ID:       82bbca25-be33-478e-9fc2-ee07aff558c7
   :END:
[[file:~/working/academic/research/alphacsf_dist_comp]]
****** DONE Set up exact tasks
       - State "DONE"       from "NEXT"       [2012-12-20 Thu 11:42]
       :LOGBOOK:
       CLOCK: [2012-12-20 Thu 11:40]--[2012-12-20 Thu 11:42] =>  0:02
       :END:
       :PROPERTIES:
       :ID:       4f722f4b-5144-460f-99ed-df219865ff85
       :END:
****** DONE Transcribe variational argument from notebook
       - State "DONE"       from "NEXT"       [2012-12-19 Wed 11:20]
       :LOGBOOK:
       CLOCK: [2012-12-19 Wed 10:02]--[2012-12-19 Wed 11:19] =>  1:17
       CLOCK: [2012-12-18 Tue 18:10]--[2012-12-18 Tue 18:20] =>  0:10
       CLOCK: [2012-12-18 Tue 13:26]--[2012-12-18 Tue 15:11] =>  1:45
       CLOCK: [2012-12-18 Tue 12:10]--[2012-12-18 Tue 12:35] =>  0:25
       :END:
       :PROPERTIES:
       :ID:       e326f80a-7e84-497c-949e-c91f0c47581f
       :END:
****** DONE Work out spectral argument
       - State "DONE"       from "TODO"       [2012-12-18 Tue 20:00]
       :LOGBOOK:
       CLOCK: [2012-12-18 Tue 18:20]--[2012-12-18 Tue 20:00] =>  1:40
       :END:
****** DONE Rewrite more sophisticated variational argument
    - State "DONE"       from "NEXT"       [2013-02-19 Tue 08:04]
    :LOGBOOK:
    CLOCK: [2013-02-18 Mon 20:57]--[2013-02-18 Mon 21:45] =>  0:48
    CLOCK: [2013-02-18 Mon 14:02]--[2013-02-18 Mon 14:34] =>  0:32
    CLOCK: [2013-02-15 Fri 10:35]--[2013-02-15 Fri 10:43] =>  0:08
    CLOCK: [2013-02-15 Fri 10:33]--[2013-02-15 Fri 10:34] =>  0:01
    :END:
    :PROPERTIES:
    :ID:       bd810aa6-d6aa-4b03-8fca-f4fa0f549cdd
    :END: 
This should not involve partial derivatives by tangent vectors to $S^1$ like in the CSF paper.
****** DONE Write introduction
       - State "DONE"       from "NEXT"       [2013-02-21 Thu 12:56]
       :LOGBOOK:
       CLOCK: [2013-02-21 Thu 12:51]--[2013-02-21 Thu 12:56] =>  0:05
       CLOCK: [2013-02-21 Thu 11:55]--[2013-02-21 Thu 12:09] =>  0:14
       CLOCK: [2013-02-20 Wed 13:30]--[2013-02-20 Wed 13:54] =>  0:24
       CLOCK: [2013-02-19 Tue 16:36]--[2013-02-19 Tue 17:42] =>  1:06
       CLOCK: [2013-02-19 Tue 09:47]--[2013-02-19 Tue 10:05] =>  0:18
       CLOCK: [2013-02-19 Tue 09:29]--[2013-02-19 Tue 10:22] =>  0:53
       CLOCK: [2013-02-19 Tue 08:06]--[2013-02-19 Tue 08:38] =>  0:32
       :END:
       :PROPERTIES:
       :ID:       f830177c-d9ea-4120-82f6-d0af42487036
       :END:
****** DONE Redo computation with correct normalised flow
       - State "DONE"       from "NEXT"       [2013-02-26 Tue 15:04]
       :LOGBOOK:
       CLOCK: [2013-02-26 Tue 13:46]--[2013-02-26 Tue 15:04] =>  1:18
       CLOCK: [2013-02-26 Tue 12:08]--[2013-02-26 Tue 13:10] =>  1:02
       CLOCK: [2013-02-26 Tue 11:35]--[2013-02-26 Tue 11:53] =>  0:18
       CLOCK: [2013-02-25 Mon 20:22]--[2013-02-25 Mon 21:15] =>  0:53
       CLOCK: [2013-02-25 Mon 13:25]--[2013-02-25 Mon 14:58] =>  1:33
       CLOCK: [2013-02-25 Mon 12:49]--[2013-02-25 Mon 13:17] =>  0:28
       CLOCK: [2013-02-25 Mon 11:31]--[2013-02-25 Mon 12:09] =>  0:38
       CLOCK: [2013-02-22 Fri 15:30]--[2013-02-22 Fri 16:05] =>  0:35
       CLOCK: [2013-02-21 Thu 14:04]--[2013-02-21 Thu 14:05] =>  0:01
       CLOCK: [2013-02-21 Thu 12:56]--[2013-02-21 Thu 13:57] =>  1:01
       :END:
       :PROPERTIES:
       :ID:       d012ffc5-cbec-4f58-8df9-91782762eb0d
       :END:
****** DONE Change max principle to $Z \geq 0$
       - State "DONE"       from "NEXT"       [2013-02-26 Tue 21:49]
       :LOGBOOK:
       CLOCK: [2013-02-26 Tue 21:02]--[2013-02-26 Tue 21:49] =>  0:47
       CLOCK: [2013-02-26 Tue 20:37]--[2013-02-26 Tue 20:43] =>  0:06
       CLOCK: [2013-02-26 Tue 19:25]--[2013-02-26 Tue 20:30] =>  1:05
       :END:
       :PROPERTIES:
       :ID:       76a2b612-5546-4a90-a96b-9acdc9d850b4
       :END:
****** DONE Change max principle back to $Z$ improving!
    - State "DONE"       from "NEXT"       [2013-02-27 Wed 14:34]
    :LOGBOOK:
    CLOCK: [2013-02-27 Wed 14:06]--[2013-02-27 Wed 14:34] =>  0:28
    :END:
    :PROPERTIES:
    :ID:       ddad714e-5a0c-45cf-93b0-0d48d52807b2
    :END:
Provided $\tilde{Z}(0)\geq 0$ I think we can get improving, not just positivity!
****** NEXT Clean up text
       :LOGBOOK:
       CLOCK: [2013-03-27 Wed 11:18]--[2013-03-27 Wed 12:08] =>  0:50
       CLOCK: [2013-03-27 Wed 10:33]--[2013-03-27 Wed 11:03] =>  0:30
       CLOCK: [2013-03-06 Wed 21:05]--[2013-03-06 Wed 21:32] =>  0:27
       CLOCK: [2013-03-06 Wed 20:30]--[2013-03-06 Wed 20:56] =>  0:26
       :END:
       :PROPERTIES:
       :ID:       82f38b9b-cfa1-4312-bbec-ef8a1c8afd17
       :END:
****** DONE Change to concave comparison.
    - State "DONE"       from "NEXT"       [2013-02-27 Wed 10:41]
    :LOGBOOK:
    CLOCK: [2013-02-27 Wed 10:07]--[2013-02-27 Wed 10:41] =>  0:34
    CLOCK: [2013-02-27 Wed 08:20]--[2013-02-27 Wed 08:54] =>  0:34
    :END:
    :PROPERTIES:
    :ID:       8fc84005-747c-4a3e-addb-cfdc8f0ed2a3
    :END:
Probably also need concave comparison functions. This should rule out $\tang_p = \tang_q$.
****** NEXT Find references for previous work
       :LOGBOOK:
       CLOCK: [2013-03-28 Thu 09:23]--[2013-03-28 Thu 10:43] =>  1:20
       CLOCK: [2013-03-27 Wed 20:22]--[2013-03-27 Wed 21:09] =>  0:47
       CLOCK: [2013-03-27 Wed 17:08]--[2013-03-27 Wed 17:47] =>  0:39
       CLOCK: [2013-03-27 Wed 15:58]--[2013-03-27 Wed 16:32] =>  0:34
       CLOCK: [2013-03-27 Wed 15:12]--[2013-03-27 Wed 15:49] =>  0:37
       CLOCK: [2013-03-27 Wed 10:22]--[2013-03-27 Wed 10:28] =>  0:06
       :END:
       :PROPERTIES:
       :ID:       261f30d2-0431-484a-bfaa-ee318fdb682d
       :END:
****** DONE Email Ben about integral estimate and model solutions
       - State "DONE"       from "NEXT"       [2013-02-21 Thu 11:49]
       :LOGBOOK:
       CLOCK: [2013-02-21 Thu 11:44]--[2013-02-21 Thu 11:49] =>  0:05
       :END:
       :PROPERTIES:
       :ID:       5cf57941-4d6b-47ca-9ed3-72ed629e304e
       :END:
****** NEXT Estimate integrals for max principle arg
    :LOGBOOK:
    CLOCK: [2013-02-27 Wed 14:34]--[2013-02-27 Wed 15:24] =>  0:50
    CLOCK: [2012-12-21 Fri 13:30]--[2012-12-21 Fri 15:32] =>  2:02
    CLOCK: [2012-12-21 Fri 11:02]--[2012-12-21 Fri 11:51] =>  0:49
    CLOCK: [2012-12-20 Thu 21:14]--[2012-12-20 Thu 21:46] =>  0:32
    CLOCK: [2012-12-20 Thu 18:45]--[2012-12-20 Thu 21:07] =>  2:22
    CLOCK: [2012-12-20 Thu 15:22]--[2012-12-20 Thu 18:07] =>  2:45
    CLOCK: [2012-12-20 Thu 11:42]--[2012-12-20 Thu 12:05] =>  0:23
    :END:
    :PROPERTIES:
    :ID:       2d45cee3-0bf7-482b-a10e-9caca013f87e
    :END:
This requires an estimate of $\int k f(k)$ analogous to Holder's for CSF where $f(k)=k$.
****** DONE Work our normalised flow
    :LOGBOOK:
    CLOCK: [2013-02-20 Wed 13:55]--[2013-02-20 Wed 15:05] =>  1:10
    :END:
    - State "DONE"       from "NEXT"       [2013-02-20 Wed 07:26]
    :PROPERTIES:
    :ID:       b63d50df-619a-46e9-88f4-460accb55823
    :END:
My computations were for the un-normalised flow.
***** DONE Set up tasks
      - State "DONE"       from "NEXT"       [2012-12-14 Fri 18:04]
      :LOGBOOK:
      CLOCK: [2012-12-14 Fri 17:20]--[2012-12-14 Fri 17:36] =>  0:16
      :END:
      :PROPERTIES:
      :ID:       324119e3-a5fc-4279-9d83-28ac27de824b
      :END:
***** DONE Copy text from thesis to paper
      - State "DONE"       from "NEXT"       [2012-12-17 Mon 10:54]
      - State "NEXT"       from "DONE"       [2012-12-13 Thu 16:06]
       	I seem to have lost the changes!
      - State "DONE"       from "NEXT"       [2012-11-15 Thu 14:58]
      :LOGBOOK:
      CLOCK: [2012-12-17 Mon 10:48]--[2012-12-17 Mon 10:54] =>  0:06
      CLOCK: [2012-12-17 Mon 10:36]--[2012-12-17 Mon 10:43] =>  0:07
      CLOCK: [2012-12-13 Thu 19:58]--[2012-12-13 Thu 20:35] =>  0:37
      CLOCK: [2012-12-13 Thu 19:29]--[2012-12-13 Thu 19:51] =>  0:22
      CLOCK: [2012-12-13 Thu 16:06]--[2012-12-13 Thu 16:43] =>  0:37
      CLOCK: [2012-11-15 Thu 14:37]--[2012-11-15 Thu 14:58] =>  0:21
      :END:
      :PROPERTIES:
      :ID:       1335d91c-32ec-499b-943b-107a42556b29
      :END:
***** TODO Transcribe from notebooks into computer
      :LOGBOOK:
      CLOCK: [2013-01-09 Wed 14:37]--[2013-01-09 Wed 15:04] =>  0:27
      CLOCK: [2013-01-09 Wed 14:06]--[2013-01-09 Wed 14:31] =>  0:25
      CLOCK: [2013-01-09 Wed 13:09]--[2013-01-09 Wed 13:49] =>  0:40
      CLOCK: [2012-12-06 Thu 14:24]--[2012-12-06 Thu 14:56] =>  0:32
      CLOCK: [2012-12-05 Wed 18:57]--[2012-12-05 Wed 19:53] =>  0:56
      CLOCK: [2012-11-16 Fri 14:29]--[2012-11-16 Fri 15:17] =>  0:48
      CLOCK: [2012-11-15 Thu 14:26]--[2012-11-15 Thu 14:37] =>  0:11
      :END:
      :PROPERTIES:
      :ID:       c7d8d816-7767-4384-9e6b-ee1bbd453e62
      :END:
***** TODO Make scans of working 
  :LOGBOOK:
  CLOCK: [2013-01-09 Wed 12:58]--[2013-01-09 Wed 13:09] =>  0:11
  :END:
    :PROPERTIES:
    :ID:       0dffabc1-bc62-4e97-a8d8-8f58d541bbc1
    :END:
[2012-11-16 Fri 15:19]

****** DONE Write viscosity equation
       - State "DONE"       from "NEXT"       [2012-12-14 Fri 18:08]
       :LOGBOOK:
       CLOCK: [2012-12-14 Fri 17:47]--[2012-12-14 Fri 18:09] =>  0:22
       :END:
       :PROPERTIES:
       :ID:       cb2801d1-92c9-4f75-8668-738f04868007
       :END: 
****** DONE Write Ricci comparison theorem
       - State "DONE"       from "NEXT"       [2012-12-14 Fri 18:16]
       :LOGBOOK:
       CLOCK: [2012-12-14 Fri 18:09]--[2012-12-14 Fri 18:16] =>  0:07
       :END:
       :PROPERTIES:
       :ID:       14a1b102-77f8-49e6-b175-d55351751e7a
       :END:
****** DONE Write sphere comparison (brief)
       - State "DONE"       from "NEXT"       [2012-12-17 Mon 11:19]
       :LOGBOOK:
       CLOCK: [2012-12-17 Mon 11:09]--[2012-12-17 Mon 11:19] =>  0:10
       :END:
       :PROPERTIES:
       :ID:       98abaabf-bfd6-4a76-a363-d99dc50187ef
       :END:
****** DONE Write planar comparison
       - State "DONE"       from "NEXT"       [2013-01-14 Mon 16:44]
       :LOGBOOK:
       CLOCK: [2013-01-14 Mon 16:37]--[2013-01-14 Mon 16:44] =>  0:07
       :END:
       :PROPERTIES:
       :ID:       f275815c-cbd9-4226-aa90-04753e3fe110
       :END:
****** NEXT Write hyperbolic quadratic comparison
       :LOGBOOK:
       CLOCK: [2013-01-14 Mon 16:45]--[2013-01-14 Mon 16:48] =>  0:03
       :END:
       :PROPERTIES:
       :ID:       ab49f64c-36f6-476f-9e02-b0ec9d72552f
       :END:
****** DONE Write porous media
       - State "DONE"       from "NEXT"       [2012-12-14 Fri 18:27]
       :LOGBOOK:
       CLOCK: [2012-12-14 Fri 18:20]--[2012-12-14 Fri 18:27] =>  0:07
       :END:
       :PROPERTIES:
       :ID:       f209c72e-822e-45e0-bf45-4ee4e36f7c58
       :END:
***** TODO Work out hyperbolic barrier
      :LOGBOOK:
      CLOCK: [2013-01-14 Mon 16:10]--[2013-01-14 Mon 16:35] =>  0:25
      CLOCK: [2013-01-14 Mon 09:10]--[2013-01-14 Mon 09:36] =>  0:26
      CLOCK: [2013-01-14 Mon 08:27]--[2013-01-14 Mon 09:04] =>  0:37
      CLOCK: [2013-01-11 Fri 14:10]--[2013-01-11 Fri 14:30] =>  0:20
      CLOCK: [2013-01-09 Wed 10:05]--[2013-01-09 Wed 10:34] =>  0:29
      CLOCK: [2013-01-09 Wed 09:57]--[2013-01-09 Wed 09:58] =>  0:01
      CLOCK: [2013-01-09 Wed 09:37]--[2013-01-09 Wed 09:57] =>  0:20
      :END:
      :PROPERTIES:
      :ID:       9576f953-1b7f-4459-915a-b8378f6d8b80
      :END:
***** DONE Check high genus comparison computations
      - State "DONE"       from "NEXT"       [2013-02-06 Wed 14:57]
      :LOGBOOK:
      CLOCK: [2013-01-11 Fri 13:00]--[2013-01-11 Fri 14:10] =>  1:10
      CLOCK: [2013-01-11 Fri 07:30]--[2013-01-11 Fri 08:05] =>  0:35
      :END:
      :PROPERTIES:
      :ID:       60cbd811-022c-4afa-bb52-bc82b8694314
      :END:			     
***** NEXT Set up exact tasks
      :LOGBOOK:
      CLOCK: [2013-02-06 Wed 14:58]--[2013-02-06 Wed 15:09] =>  0:11
      :END:
      :PROPERTIES:
      :ID:       bd4e49ca-6f78-44af-aa3b-782d2eb98ff3
      :END:
***** TODO Transcribe pipe examples from Bei Da notebook
  :LOGBOOK:
  CLOCK: [2012-11-20 Tue 10:48]--[2012-11-20 Tue 10:49] =>  0:01
  :END:
  :PROPERTIES:
  :ID:       1940744d-17a2-4b3c-9051-b5eead539aa8
  :END:
[2012-11-20 Tue 10:48]

****** DONE Write up outline and send to Chen
       - State "DONE"       from "NEXT"       [2013-04-25 Thu 20:31]
       :LOGBOOK:
       CLOCK: [2013-04-25 Thu 19:31]--[2013-04-25 Thu 20:31] =>  1:00
       :END:
****** NEXT Work out embedding unit sphere and tangent plane into space forms
       :LOGBOOK:
       CLOCK: [2013-04-30 Tue 08:25]--[2013-04-30 Tue 08:55] =>  0:30
       CLOCK: [2013-04-29 Mon 18:25]--[2013-04-29 Mon 18:55] =>  0:30
       CLOCK: [2013-04-26 Fri 10:15]--[2013-04-26 Fri 11:33] =>  1:18
       :END:
       :PROPERTIES:
       :ID:       5d7d38ad-aac0-409d-9ece-466e858612c9
       :END:

****** NEXT Work out support function parametrisation
       :LOGBOOK:
       CLOCK: [2013-04-30 Tue 19:16]--[2013-04-30 Tue 21:25] =>  2:09
       CLOCK: [2013-04-30 Tue 18:09]--[2013-04-30 Tue 18:36] =>  0:27
       CLOCK: [2013-04-30 Tue 14:00]--[2013-04-30 Tue 16:00] =>  2:00
       :END:
       :PROPERTIES:
       :ID:       0548f728-0249-4589-805b-f4b1340895b1
       :END:
- i.e. construct a parametrisation from the support function.
- Is it true that $\exp_O (s(x)\nor(x) + T(x)) = x$ with $T(x) = \grad s$ tangent?
***** NEXT Compute Hessian of d
      :LOGBOOK:
      CLOCK: [2012-11-27 Tue 17:45]--[2012-11-27 Tue 19:15] =>  1:30
      CLOCK: [2012-11-27 Tue 14:05]--[2012-11-27 Tue 14:30] =>  0:25
      :END:
      :PROPERTIES:
      :ID:       ed26585a-2582-48bc-a787-2a457954b383
      :END:

***** DONE Set up exact tasks
      - State "DONE"       from "NEXT"       [2013-02-06 Wed 14:56]
      :LOGBOOK:
      CLOCK: [2013-02-06 Wed 14:53]--[2013-02-06 Wed 14:56] =>  0:03
      :END:
      :PROPERTIES:
      :ID:       264e8cb9-0195-4424-8b4a-7564af954309
      :END:
***** TODO Make outline of book
   :LOGBOOK:
   CLOCK: [2013-03-02 Sat 15:25]--[2013-03-02 Sat 15:34] =>  0:09
   CLOCK: [2013-03-02 Sat 13:41]--[2013-03-02 Sat 14:26] =>  0:45
   CLOCK: [2013-03-02 Sat 12:37]--[2013-03-02 Sat 13:02] =>  0:25
   CLOCK: [2013-02-28 Thu 16:27]--[2013-02-28 Thu 17:55] =>  1:28
   CLOCK: [2013-02-28 Thu 14:31]--[2013-02-28 Thu 15:34] =>  1:03
   CLOCK: [2013-02-28 Thu 14:02]--[2013-02-28 Thu 14:08] =>  0:06
   CLOCK: [2013-02-28 Thu 11:50]--[2013-02-28 Thu 12:35] =>  0:45
   :END:
   :PROPERTIES:
   :ID:       2b1f653b-3d67-4b05-92a8-44b2afc74546
   :END:
****** NEXT Collect references
       :LOGBOOK:
       CLOCK: [2013-03-01 Fri 15:29]--[2013-03-01 Fri 15:37] =>  0:08
       :END:
       :PROPERTIES:
       :ID:       f7419a9b-0805-4772-9361-0d2fb997bd2c
       :END:
***** DONE org-mode create ref should create bib, mr/arxiv links
      - State "DONE"       from "NEXT"       [2013-02-05 Tue 14:05]
      :LOGBOOK:
      CLOCK: [2013-02-05 Tue 13:24]--[2013-02-05 Tue 14:05] =>  0:41
      :END:
      :PROPERTIES:
      :ID:       03789ba0-7a21-4b06-bbe0-70a1f06edde1
      :END:
**** NEXT pdf scraping tool to create bib entries and rename pdf files
     :LOGBOOK:
     CLOCK: [2013-03-23 Sat 20:59]--[2013-03-23 Sat 22:52] =>  1:53
     CLOCK: [2013-03-23 Sat 10:59]--[2013-03-23 Sat 11:14] =>  0:15
     CLOCK: [2013-03-22 Fri 20:55]--[2013-03-22 Fri 21:48] =>  0:53
     CLOCK: [2013-03-22 Fri 20:17]--[2013-03-22 Fri 20:51] =>  0:34
     CLOCK: [2013-03-21 Thu 14:51]--[2013-03-21 Thu 15:22] =>  0:31
     CLOCK: [2013-03-21 Thu 14:19]--[2013-03-21 Thu 14:45] =>  0:26
     CLOCK: [2013-03-21 Thu 13:46]--[2013-03-21 Thu 14:12] =>  0:33
     CLOCK: [2013-03-21 Thu 12:35]--[2013-03-21 Thu 13:01] =>  0:26
     CLOCK: [2013-03-21 Thu 10:26]--[2013-03-21 Thu 11:30] =>  1:04
     CLOCK: [2013-02-08 Fri 10:10]--[2013-02-08 Fri 10:49] =>  0:39
     :END:
This should open pdf's, get doi info and then look up the paper details
online to get bib type info. Then the paper can be renamed, a bib entry
can be created or downloaded, say from mathscinet or arxiv. I'd aso like this
to create an org-mode headline for my refs.org file. I don't want to do this
manually, though a bit of elisp should be able to iterate over each bib
entry (using reftex?) and update the refs.org file. I may also want to store
each bib entry in a seperate file and have refs.bib a concatenation of the lot
so that I don't have problems editing refs.bib from multiple places.
See [[http://en.dogeno.us/2010/02/release-a-python-script-for-organizing-scientific-papers-pyrenamepdf-py/][pyrename-pdf]]
  CLOCK: [2012-10-26 Fri 13:04]--[2012-10-26 Fri 13:06] =>  0:02
    :PROPERTIES:
    :ID:       751a6769-bf15-4590-925c-d1eb938a03b3
    :END:
[2012-10-26 Fri 13:04]

**** DONE Collect pdf's into single directory
     - State "DONE"       from "NEXT"       [2013-01-08 Tue 08:51]
     :LOGBOOK:
     CLOCK: [2013-01-08 Tue 08:46]--[2013-01-08 Tue 08:51] =>  0:05
     :END:
    :PROPERTIES:
    :ID:       9defa0b0-c473-4347-9cf3-574714e81f7d
    :END:
     [[file:~/research_resources]]
**** NEXT Tag papers in ref.org so I can find papers by subject!
     SCHEDULED: <2013-06-17 Mon>
  :LOGBOOK:
  CLOCK: [2013-03-01 Fri 13:57]--[2013-03-01 Fri 14:00] =>  0:03
  :END:
  :PROPERTIES:
  :ID:       fd828213-33b7-4ebd-9292-b1323dd3baff
  :END:
[2013-03-01 Fri 13:57]

I could also have author, title, date etc. in the properties drawer! This is redundant, but means I can search my org file on author etc.
No! Maybe I can use reftex and get it to take me to the entry in refs.org? I can certainly due this manually, using reftex to take me to the bib file which gives the ID which I can search for in the org file. Then I don't need to maintain duplicate info in the org and bib files and have all the power of reftex available.
I'd like to be able to use org-mode views to show papers/books by a given author or by subject. Maybe I can have some sort of hook that uses reftex to do the search and return a list of ID's which is then the filter for org-mode views.
*** DONE Create research projects with tasks
    - State "DONE"       from "NEXT"       [2012-12-03 Mon 16:56]
    :LOGBOOK:
    CLOCK: [2012-12-03 Mon 16:10]--[2012-12-03 Mon 16:57] =>  0:47
    :END:
    :PROPERTIES:
    :ID:       3679901e-c496-4a9f-924a-207740991872
    :END:
- [X] Ricci isoperimetric comparison project
- [X] Pipe flows
- [X] MCF Book
- [X] submanifolds book
- [X] $\alpha$ curve flows
- [X] dist. comp. on surfaces
- [X] cmc_stability
- [X] csf_networks
- [X] csf_isoprofile_surfaces
- [X] Vector symmetric polynomials
- [X] free_k_graphs
- [X] ricci_isoprofile_comparison_kahler_manifolds
- [X] ricci_pseudo_locality
- [X] ricci_degenerate_neck_pinches
- [X] ricci _flow_warped_products
- [X] bakry_emery_levy_gromov

*** Research Pondering
    :LOGBOOK:
    CLOCK: [2013-04-11 Thu 15:01]--[2013-04-11 Thu 15:35] =>  0:34
    CLOCK: [2013-04-11 Thu 11:07]--[2013-04-11 Thu 11:59] =>  0:52
    CLOCK: [2013-04-10 Wed 16:10]--[2013-04-10 Wed 16:25] =>  0:15
    CLOCK: [2013-04-08 Mon 17:00]--[2013-04-08 Mon 17:25] =>  0:25
    CLOCK: [2013-04-04 Thu 12:50]--[2013-04-04 Thu 13:10] =>  0:20
    CLOCK: [2013-04-04 Thu 11:15]--[2013-04-04 Thu 11:55] =>  0:40
    CLOCK: [2013-03-29 Fri 12:50]--[2013-03-29 Fri 13:20] =>  0:30
    CLOCK: [2013-03-14 Thu 09:35]--[2013-03-14 Thu 11:20] =>  1:45
    CLOCK: [2013-03-12 Tue 16:25]--[2013-03-12 Tue 16:44] =>  0:19
    CLOCK: [2013-03-12 Tue 10:22]--[2013-03-12 Tue 10:48] =>  0:26
    CLOCK: [2013-03-12 Tue 10:07]--[2013-03-12 Tue 10:22] =>  0:15
    CLOCK: [2013-03-12 Tue 09:59]--[2013-03-12 Tue 10:05] =>  0:06
    CLOCK: [2013-03-11 Mon 08:30]--[2013-03-11 Mon 09:03] =>  0:33
    CLOCK: [2013-03-06 Wed 09:50]--[2013-03-06 Wed 10:55] =>  1:05
    CLOCK: [2013-02-27 Wed 12:50]--[2013-02-27 Wed 13:50] =>  1:00
    CLOCK: [2013-02-20 Wed 13:17]--[2013-02-20 Wed 13:30] =>  0:13
    CLOCK: [2013-02-08 Fri 14:45]--[2013-02-08 Fri 15:18] =>  0:33
    CLOCK: [2013-02-08 Fri 13:05]--[2013-02-08 Fri 14:00] =>  0:55
    CLOCK: [2013-02-06 Wed 14:16]--[2013-02-06 Wed 14:29] =>  0:13
    CLOCK: [2013-02-06 Wed 12:55]--[2013-02-06 Wed 13:40] =>  0:45
    CLOCK: [2013-02-03 Sun 14:45]--[2013-02-03 Sun 16:51] =>  2:06
    CLOCK: [2012-12-17 Mon 21:05]--[2012-12-17 Mon 21:30] =>  0:25
    CLOCK: [2012-12-17 Mon 12:30]--[2012-12-17 Mon 13:30] =>  1:00
    CLOCK: [2012-12-11 Tue 07:30]--[2012-12-11 Tue 08:30] =>  1:00
    CLOCK: [2012-12-06 Thu 12:49]--[2012-12-06 Thu 13:25] =>  0:36
    CLOCK: [2012-12-05 Wed 14:15]--[2012-12-05 Wed 15:00] =>  0:45
    CLOCK: [2012-12-05 Wed 12:00]--[2012-12-05 Wed 12:30] =>  0:30
    CLOCK: [2012-11-28 Wed 14:05]--[2012-11-28 Wed 14:50] =>  0:45
    CLOCK: [2012-11-28 Wed 13:00]--[2012-11-28 Wed 13:37] =>  0:42
    :END:
    
**** TODO Look at 's MCF in hyperbolic space
  :LOGBOOK:
  CLOCK: [2013-04-09 Tue 10:38]--[2013-04-09 Tue 10:39] =>  0:01
  :END:
  :PROPERTIES:
  :ID:       01b84b87-b568-4a70-96e1-f98c4f02de22
  :END:
[2013-04-09 Tue 10:38]
*** Literature reviewing
    :LOGBOOK:
    CLOCK: [2012-12-18 Tue 11:10]--[2012-12-18 Tue 11:33] =>  0:23
    CLOCK: [2012-12-18 Tue 09:45]--[2012-12-18 Tue 10:27] =>  0:42
    :END:
*** Distance function and position vector field
    :LOGBOOK:
    CLOCK: [2013-03-13 Wed 15:00]--[2013-03-13 Wed 15:15] =>  0:15
    :END:
[[www.math.ucsb.edu/~wei/paper/241B.pdf]]
Can I solve a PDE to get a position vector field vanishing along the
cut locus? This would be it: [[file:research_notes.org::*Blackboard][Blackboard]].

*** Support functions, Killing fields, Translation maps on manifolds
    :LOGBOOK:
    CLOCK: [2013-03-18 Mon 11:41]--[2013-03-18 Mon 12:02] =>  0:21
    CLOCK: [2013-03-14 Thu 14:19]--[2013-03-14 Thu 15:04] =>  0:45
    CLOCK: [2013-03-14 Thu 12:34]--[2013-03-14 Thu 13:48] =>  1:14
    CLOCK: [2013-03-13 Wed 14:45]--[2013-03-13 Wed 14:52] =>  0:07
    CLOCK: [2013-03-13 Wed 13:52]--[2013-03-13 Wed 14:41] =>  0:49
    CLOCK: [2013-03-13 Wed 13:22]--[2013-03-13 Wed 13:42] =>  0:20
    :END:
    :PROPERTIES:
    :ID:       08506127-8b7b-47cf-943a-ffb2fa86170c
    :END:
*** Non-collapsing
    :LOGBOOK:
    CLOCK: [2013-03-19 Tue 16:31]--[2013-03-19 Tue 16:50] =>  0:19
    CLOCK: [2013-03-19 Tue 15:03]--[2013-03-19 Tue 16:31] =>  1:28
    CLOCK: [2013-03-19 Tue 13:56]--[2013-03-19 Tue 14:39] =>  0:43
    CLOCK: [2013-03-19 Tue 12:05]--[2013-03-19 Tue 12:23] =>  0:18
    CLOCK: [2013-03-18 Mon 12:55]--[2013-03-18 Mon 13:39] =>  0:44
    CLOCK: [2013-03-15 Fri 15:05]--[2013-03-15 Fri 16:19] =>  1:14
    CLOCK: [2013-03-15 Fri 14:10]--[2013-03-15 Fri 14:58] =>  0:48
    CLOCK: [2013-03-15 Fri 09:05]--[2013-03-15 Fri 09:35] =>  0:30
    CLOCK: [2013-03-13 Wed 15:15]--[2013-03-13 Wed 15:48] =>  0:33    
    :END:
*** TODO Research Geometric Measure Theory/Geometric Integration Theory
  :LOGBOOK:
  CLOCK: [2013-03-26 Tue 13:44]--[2013-03-26 Tue 13:47] =>  0:03
  :END:
    :PROPERTIES:
    :ID:       a2b27ca7-714c-4bff-98d0-4d376c383818
    :END:
[2013-03-26 Tue 13:44]

*** TODO Solitions and ancient solutions
  :LOGBOOK:
  CLOCK: [2013-03-26 Tue 13:47]--[2013-03-26 Tue 13:49] =>  0:02
  :END:
    :PROPERTIES:
    :ID:       456d22c6-d6a3-4476-b6fe-918b91446f6e
    :END:
[2013-03-26 Tue 13:47]
** GMT
   :LOGBOOK:
   CLOCK: [2013-04-26 Fri 09:35]--[2013-04-26 Fri 09:54] =>  0:19
   :END:
** DONE Seminars org project
   - State "DONE"       from "TODO"       [2012-10-18 Thu 11:13]
  CLOCK: [2012-10-14 Sun 20:38]--[2012-10-14 Sun 20:38] =>  0:00
[2012-10-14 Sun 20:38]
** TODO Invite Visitors						    :SOMEDAY:
Some money available through colloquia funds?
  CLOCK: [2012-10-14 Sun 20:39]--[2012-10-14 Sun 20:40] =>  0:01
   :PROPERTIES:
   :ID:       e922bc74-823a-4909-83a9-fbc7b63a93d7
   :END:
[2012-10-14 Sun 20:39]
** DONE Register for SD Geom conference
   - State "DONE"       from "NEXT"       [2013-02-06 Wed 14:13]
  :LOGBOOK:
  CLOCK: [2013-02-06 Wed 14:09]--[2013-02-06 Wed 14:13] =>  0:04
  :END:
  :PROPERTIES:
  :ID:       2350dd28-f465-44bd-a9ec-e9f3e77df37b
  :END:
[2013-01-30 Wed 08:18]
** CANCELLED Plan visit to ASU
   SCHEDULED: <2013-02-18 Mon>
   - State "CANCELLED"  from "TODO"       [2013-04-11 Thu 09:51] \\
     It didn't work out.
  :LOGBOOK:
  CLOCK: [2013-04-10 Wed 09:53]--[2013-04-10 Wed 10:07] =>  0:14
  CLOCK: [2013-03-29 Fri 10:29]--[2013-03-29 Fri 10:42] =>  0:13
  :END:
   :PROPERTIES:
   :ID:       dd8dd55b-3581-44ca-af2a-8d193fc8ed95
   :END:
[2013-02-04 Mon 10:09]
Possible dates: 5/4/13, 12/4/13, 19/4/13

** SCGAS 2013
   :LOGBOOK:
   CLOCK: [2013-02-24 Sun 08:40]--[2013-02-24 Sun 13:35] =>  4:55
   CLOCK: [2013-02-23 Sat 09:20]--[2013-02-23 Sat 20:30] => 11:10
   :END:
   :PROPERTIES:
   :ID:       ca1c1d9d-cea8-425a-ab03-2f7caaa10765
   :END:
   <2013-02-23 Sat 08:30>--<2013-02-24 Sun 14:30>

** TODO PNGS 2013 						      :FOCUS:
   :LOGBOOK:
   CLOCK: [2013-03-29 Fri 10:49]--[2013-03-29 Fri 10:54] =>  0:05
   CLOCK: [2013-03-29 Fri 10:46]--[2013-03-29 Fri 10:48] =>  0:02
   CLOCK: [2013-03-29 Fri 10:43]--[2013-03-29 Fri 10:45] =>  0:02
   CLOCK: [2013-03-19 Tue 13:49]--[2013-03-19 Tue 13:54] =>  0:05
   :END:
   :PROPERTIES:
   :ID:       aaff0fd5-ad8f-4699-9c28-36e76cc1194c
   :END:
<2013-05-11 Sat>--<2013-05-12 Sun>
[[http://www.math.washington.edu/~lee/PNGS/]]
[[file:~/working/academic/seminars/pngs_2013/]]
*** TODO Write PNGS talk
    DEADLINE: <2013-05-08 Wed> SCHEDULED: <2013-03-11 Mon>   
    :LOGBOOK:
    CLOCK: [2013-05-07 Tue 13:22]--[2013-05-07 Tue 13:33] =>  0:11
    CLOCK: [2013-05-07 Tue 10:57]--[2013-05-07 Tue 11:30] =>  0:33
    CLOCK: [2013-04-27 Sat 21:08]--[2013-04-27 Sat 21:48] =>  0:40
    CLOCK: [2013-04-22 Mon 10:54]--[2013-04-22 Mon 11:01] =>  0:07
    CLOCK: [2013-04-22 Mon 09:54]--[2013-04-22 Mon 10:43] =>  0:49
    CLOCK: [2013-03-29 Fri 13:55]--[2013-03-29 Fri 14:13] =>  0:18
    CLOCK: [2013-03-29 Fri 13:24]--[2013-03-29 Fri 13:25] =>  0:01
    CLOCK: [2013-03-29 Fri 11:28]--[2013-03-29 Fri 12:01] =>  0:33
    CLOCK: [2013-03-29 Fri 10:57]--[2013-03-29 Fri 11:15] =>  0:18
    :END:
    :PROPERTIES:
    :ID:       ae9f534c-7445-42d4-a56e-a4dcf52119b6
    :END:

**** DONE Write distance comparison
     - State "DONE"       from "NEXT"       [2013-04-28 Sun 15:37]
     :LOGBOOK:
     CLOCK: [2013-04-28 Sun 15:23]--[2013-04-28 Sun 15:37] =>  0:14
     :END:
**** DONE Write Hamilton isoperimetric comparison
     - State "DONE"       from "NEXT"       [2013-04-28 Sun 17:50]
     :LOGBOOK:
     CLOCK: [2013-04-28 Sun 17:39]--[2013-04-28 Sun 17:50] =>  0:11
     :END:
- Consult thesis for details or get conference proceedings

**** DONE Viscosity equations
     - State "DONE"       from "NEXT"       [2013-04-28 Sun 18:07]
     :LOGBOOK:
     CLOCK: [2013-04-28 Sun 17:50]--[2013-04-28 Sun 18:07] =>  0:17
     :END:
**** DONE Hamilton/Jacobi viscosity equation
     - State "DONE"       from "NEXT"       [2013-04-29 Mon 20:39]
     :LOGBOOK:
     CLOCK: [2013-04-29 Mon 10:39]--[2013-04-29 Mon 11:07] =>  0:28
     :END:
     :PROPERTIES:
     :ID:       785766b0-1d74-4290-afe8-3ab14da6fe15
     :END:
- Consult Mategazza et. al - 2 papers!
**** DONE Distance comparison slide 
     - State "DONE"       from "NEXT"       [2013-05-07 Tue 13:43]
     :LOGBOOK:
     CLOCK: [2013-05-07 Tue 13:33]--[2013-05-07 Tue 13:43] =>  0:10
     CLOCK: [2013-04-29 Mon 20:39]--[2013-04-29 Mon 20:50] =>  0:11
     :END:
     :PROPERTIES:
     :ID:       f14d4391-4820-4a0f-af03-11db4d087460
     :END:
- Defn of $f$
- Comparison theorem
- Mention viscosity equations
- Can I phrase this as $Z$ is a viscosity eqn of $\pd{t}Z \geq 0$?
**** NEXT Isoperimetric comparison slides
     :LOGBOOK:
     CLOCK: [2013-04-30 Tue 12:34]--[2013-04-30 Tue 13:08] =>  0:34
     CLOCK: [2013-04-30 Tue 10:55]--[2013-04-30 Tue 11:28] =>  0:33
     CLOCK: [2013-04-29 Mon 20:50]--[2013-04-29 Mon 20:55] =>  0:05
     :END:
     :PROPERTIES:
     :ID:       7916c4dc-1218-469c-9429-b066b6e3bf53
     :END:
- Picture
- Fix layout of comparison theorem slide
*** CANCELLED Talk to Kate about going to Rio
    SCHEDULED: <2013-02-13 Wed> DEADLINE: <2013-02-18 Mon>
    - State "CANCELLED"  from "TODO"       [2013-02-15 Fri 20:47] \\
      Can't go since it clashes with teaching.
  :LOGBOOK:
  CLOCK: [2013-02-13 Wed 14:17]--[2013-02-13 Wed 14:18] =>  0:01
  :END:
    :PROPERTIES:
    :ID:       87fd6545-739b-4d1e-bae9-8adedcec5537
    :END:
[2013-02-13 Wed 14:17]
***** DONE Write title and abstract
      - State "DONE"       from "NEXT"       [2013-03-26 Tue 21:15]
      :LOGBOOK:
      CLOCK: [2013-03-26 Tue 20:50]--[2013-03-26 Tue 21:15] =>  0:25
      :END:
** DONE Contact Ben Andrews about MCF, geometric evolution eqn's books
   - State "DONE"       from "TODO"       [2012-11-09 Fri 11:47]
  CLOCK: [2012-10-17 Wed 08:23]--[2012-10-17 Wed 08:23] =>  0:00
   :PROPERTIES:
   :ID:       23b5f090-7dcb-4d25-aa13-be5827182c87
   :END:
[2012-10-17 Wed 08:23]

** TODO Transcribe trace from Bei Da notebook
  :LOGBOOK:
  CLOCK: [2012-11-20 Tue 10:50]--[2012-11-20 Tue 10:53] =>  0:03
  :END:
  :PROPERTIES:
  :ID:       4f5359c0-36aa-40f8-be49-85b17c2f2996
  :END:
[2012-11-20 Tue 10:50]
* Networking
   :LOGBOOK:
   CLOCK: [2013-01-08 Tue 11:00]--[2013-01-08 Tue 13:00] =>  2:00
   :END:
  :PROPERTIES:
  :ID:       11e903a0-7ecf-45d4-ac54-4aec405e7d23
  :END:
